---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.DirectoryNotEmptyException
source: html/33bce331-e772-4a3d-5090-ef89f1552325.htm
---
# DirectoryNotEmptyException Methods

Retrieves data needed to serialize the target object.